<?php
/*
 * Изменение исчисления времени произойдет 26 октября 2014 года в 2:00 местного времени.
 * http://habrahabr.ru/post/239827/
 * UTC+4 -> UTC+3
 * Магадан 12 -> 10
 * Исключения составляют:
 * в Республике Удмуртия и Самарской области следует выполнить ручное переключение на часовой пояс “Russian Time Zone 3” вместо автоматически установленного часового пояса RTZ 2 (Russian Time Zone 2);
 * в Кемеровской области следует выполнить ручное переключение на часовой пояс “Russian Time Zone 6” вместо автоматически установленного часового пояса RTZ 5 (Russian Time Zone 5);
 * в Забайкальском крае следует выполнить ручное переключение на часовой пояс “Russian Time Zone 7” вместо автоматически установленного часового пояса RTZ 8 (Russian Time Zone 8).
 */
?>